{"pages":[{"text":"Emacs and java are not good friends, for most of java programmers, the best choice of programming tools are IDE , for example Eclipse or IntelliJ IDEA , I agree that IDE is very friendly for Java programming especially for the web development for java, Most of my time is spent on IDE as well, I am a Emacs+ user in Eclipse, the experience is similar. However, I think there are some time for me to use emacs rather than IDE . When I just open Emacs to code rather than Eclipse 1. When I want to focus on the design of code and structure of my programe , IDE is too annoying when I want to just write some interface or designing code. IDE sometimes just pop up a lot of code suggest andmay lead me to another direction. 2. When I want to combine the frontend code and backend code together. I just want to use emacs. Emacs provide a good auto-complete function for html (Emmet), CSS and JS , I don't think Eclipse is good enough to handle these together. I don't like to switch between Emacs and Eclipse very often, that will make me lost. 3. When I want to learn something new in Java. Emacs will make me focus on these features and try to remember these new features by head. Solution: There are three options for java programming in Emacs. One is Malarbra , but I didn't successfully make that run, and I think you have to use some limited version of maven to make that run according to the specification. Another choice is JDEE <http://jdee.sourceforge.net> , which is a little old but a new version is under development. I think that is a good choice but still need some time to be ready. The last choice is Emacs-eclim , which is actually a shell for eclipse server, actually we still use Eclipse but use Emacs as a proxy and I think that is the best choice so far. Another mode your should never forget is yassnippet, for java install the this mode yasnippet-java-mode Some Benefit Almost everything for Eclipse, you could insert getter and setter, problem report, auto import, auto suggest, but everything is called by yourself. So you could focus on the structure and correct errors after you finish the design. Just check the mode's function and their names tell itself. Better Keybind, because I am using evil mode in emacs, so that means I could use vi and emacs together to code with the help of Eclipse. Here is a example to show a problem report in my Java Spring Project (The import java.util.HashSet is never used). ![Problem report in Spring Project]({filename}/images/emacs-eclim-problem.png) Some Tips and pitfall Don't use eclimd, which is a eclipse server in Emacs. That would make your Emacs crash. Instead, using Eclimd in terminal, I tried that in Mac, everything is OK . You may need to set the varialble of eclim-executable variable in emacs to taget the eclim if you install Eclipse and Eclim in other place. Finally, install eclim For reference, in my Emacs setting. ( require-package 'emacs-eclim ) ;;; enable the eclim ( require 'eclim ) ( global-eclim-mode ) ;; regular auto-complete initialization ( require 'auto-complete-config ) ( ac-config-default ) ;; add the emacs-eclim source ( require 'ac-emacs-eclim-source ) ( ac-emacs-eclim-config ) ( setq eclim-executable \"/Applications/Eclipse.app/Contents/Eclipse/eclim\" ) ( provide 'init-eclim )","tags":"programming","loc":"http://caoyuanqi.github.io/emacs_java_environment","title":"Emacs java development"},{"text":"Emacs rocks but not for the java project, for spring, hibernate the smart auto completing of Eclipe still is the best tools for the Emacs. Eclipse includes the Emacs keybind but that is not powerful enough for coding for Java programmer. Luckily, Emacs ++ could bring some cool feature for emacser. some feature split the windows auto complete delete-by-word and kill-line c-x o to switch buffer","tags":"programming","loc":"http://caoyuanqi.github.io/emacseclipse","title":"Emacs + Eclipse"},{"text":"to be continue","tags":"Programming","loc":"http://caoyuanqi.github.io/myemacsroad","title":"My Emacs Road"},{"text":"In the daily life, I prefer to use emacs org mode to manage my time and I also use iphone and macbook. The org mode is a perfect way to manage your time but iphone and calendar is a good way to track your time. So is there a good way to let them work better for me? I tried org mobile before, but it is really hard to use in iphone , and it will create some mark line in the pushed event which make the org file more hard to read. I also tryed org-mac-ical.el but it is out of date and it can not work in OSX 10.10 now. There is no good solution on the Internet. So one year ago, I made a perl script to parse the org file and import events into Calendar in OSX . Because it calls relative apple-script command to import events, it will work fine for further version of OSX without any changes. It will automaticly import an event into osx calendar when you assigned a time to it. If your iphone is connected into cloud, it will of course alert your automaticly. And you can check your schedule on both org agenda and your iphone and clendar on the OSX . The logic is simple: 1. When emacs store the org file in org mode or org agenda, call the script 2. The script will scan the org file and try to import the files into calendar one by one 3. When it finish scan it will store the added event time into time.txt 4. When any time is added, the event started with the same time will not be added To use the script, you should added this script into your PATH and give it excutive right. Added this line into your emacs setting files, there will add a hook and call the script every time you store any org file ( add-hook 'after-save-hook ' ( lambda () (( if ( or ( eq major-mode 'org-mode ) ( eq major-mode 'org-agenda-mode )) ( progn ( setq org-add-event-command ( concat \"< \" buffer-file-name )) ( call-process-shell-command \"_org_file_handler\" nil nil nil org-add-event-command )))))) You should decide a way for the time.txt this will store all time stamp you already imported in the script $time_file = \"where/your/want/to/put/the/time.txt\" Most importantly, you should arrange your org file into this style, because this script will scan the * header as the calendar it want to insert the event: * calendar name in osx calendar ** Other thing For example, if I want to insert an event named: exercise into a calendar named life in osx calendar, I will make this even like below: * life ** exercise SCHEDULED: <2015-01-09 Fri 13:00-14:00> Because it is a script I made almost 1 year ago and it works very well for me, there are some thing need to do better, but if there is no big problem, I won't fix it, because maybe I will rewrite the script in Python in object oritential style. So if there are any interesting ideas to let me know? A. The calendar have to restart to make the events be refreshed. (I think it is apple's problem) B. time.txt maybe should be clean up, but it is not a big issue for us C. I tell the application every time I want to add an event, I should be tell once and add many, but I am really lazy to change that. &#94;-&#94; I think it will work fine for you. enjoy!","tags":"Programming","loc":"http://caoyuanqi.github.io/orgtoosxcalendar","title":"Import emacs org mode agenda into osx calendar(perl)"},{"text":"Hi, 2015 and the world This is my personal website, and I treat it like a personal hacking note and some organization of some technical thinking. So I will keep the words simple and focus. I think I should get some wish in the new year: Happy life More powerful hacking skills More time with my family Job Health So, ready let's go","tags":"Blogs","loc":"http://caoyuanqi.github.io/hello world","title":"Hello world"}]}